#+title: System Admin Tools
#+author: eric gustafson

* Goal
Using common lisp to perform system administration tasks focusing on
Wifi and network administration routines


* Key Files

** Org files
#+name: orgfiles
#+BEGIN_SRC sh :results output value table :exports results
   find . -name '[^.]*.org' -print | perl -pi -e 's/(^.*$)/\[\[file:$1\]\]/g' | sort
#+END_SRC

#+RESULTS: orgfiles
| [[file:./devdocs/wifi.org]] |
| [[file:./readme.org]]       |
| [[file:./work/work.org]]    |


** Lisp source files
#+BEGIN_SRC sh :results output value table :exports results
  ls *.lisp | perl -pi -e 's/(^.*$)/\[\[file:$1\]\]/g' | sort
#+END_SRC

#+RESULTS:
| [[file:lsa.lisp]]           |
| [[file:package.lisp]]       |
| [[file:wireless-info.lisp]] |




* Parsing Targets

  | cmd     | Description |
  |---------+-------------|
  | ip link |             |


* Parsing Challenges

** ip

   These were thrown together, parsing things using the
   [[file:lsa.lisp::(defun%20common-splitter%20(txt)][common-splitter]] utility function.  There is a ppcre function
   create-scanner, and we seed it into multi-line-mode, usage
   is [[file:lsa.lisp::(defparameter%20*if-scanner-splitter*%20(ppcre:create-scanner%20"^\\d+:"%20:multi-line-mode%20t))][here]].

*** ip addr
#+name: ip-addr-output
#+BEGIN_SRC sh :results output  :exports both
   ip addr
#+END_SRC

#+RESULTS: ip-addr-output
#+begin_example
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host 
       valid_lft forever preferred_lft forever
2: wlo1: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP group default qlen 1000
    link/ether 48:45:20:ef:5b:e6 brd ff:ff:ff:ff:ff:ff
    inet 192.168.11.124/24 brd 192.168.11.255 scope global dynamic noprefixroute wlo1
       valid_lft 79962sec preferred_lft 79962sec
    inet6 fe80::2ba4:9934:e976:da52/64 scope link noprefixroute 
       valid_lft forever preferred_lft forever
3: virbr0: <NO-CARRIER,BROADCAST,MULTICAST,UP> mtu 1500 qdisc noqueue state DOWN group default qlen 1000
    link/ether 52:54:00:87:45:88 brd ff:ff:ff:ff:ff:ff
    inet 192.168.122.1/24 brd 192.168.122.255 scope global virbr0
       valid_lft forever preferred_lft forever
4: virbr0-nic: <BROADCAST,MULTICAST> mtu 1500 qdisc fq_codel master virbr0 state DOWN group default qlen 1000
    link/ether 52:54:00:87:45:88 brd ff:ff:ff:ff:ff:ff
#+end_example


*** ip link
**** shell   

#+name: ip-link-output
#+BEGIN_SRC sh :results output  :exports both
   ip link
#+END_SRC
 
#+RESULTS: ip-link-output
: 1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000
:     link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
: 2: wlo1: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP mode DORMANT group default qlen 1000
:     link/ether 48:45:20:ef:5b:e6 brd ff:ff:ff:ff:ff:ff
: 3: virbr0: <NO-CARRIER,BROADCAST,MULTICAST,UP> mtu 1500 qdisc noqueue state DOWN mode DEFAULT group default qlen 1000
:     link/ether 52:54:00:87:45:88 brd ff:ff:ff:ff:ff:ff
: 4: virbr0-nic: <BROADCAST,MULTICAST> mtu 1500 qdisc fq_codel master virbr0 state DOWN mode DEFAULT group default qlen 1000
:     link/ether 52:54:00:87:45:88 brd ff:ff:ff:ff:ff:ff

**** lsa module

 #+BEGIN_SRC lisp  :results table
   (ip-link)
 #+END_SRC

 #+RESULTS:
 | lo         | <LOOPBACK,UP,LOWER_UP>              | mtu | 65536 | qdisc | noqueue  | state  | UNKNOWN | mode  | DEFAULT | group | default | qlen  |    1000 | link/loopback | 00:00:00:00:00:00 | brd        | 00:00:00:00:00:00 |     |                   |
 | wlo1       | <BROADCAST,MULTICAST,UP,LOWER_UP>   | mtu |  1500 | qdisc | noqueue  | state  | UP      | mode  | DORMANT | group | default | qlen  |    1000 | link/ether    | 48:45:20:ef:5b:e6 | brd        | ff:ff:ff:ff:ff:ff |     |                   |
 | virbr0     | <NO-CARRIER,BROADCAST,MULTICAST,UP> | mtu |  1500 | qdisc | noqueue  | state  | DOWN    | mode  | DEFAULT | group | default | qlen  |    1000 | link/ether    | 52:54:00:87:45:88 | brd        | ff:ff:ff:ff:ff:ff |     |                   |
 | virbr0-nic | <BROADCAST,MULTICAST>               | mtu |  1500 | qdisc | fq_codel | master | virbr0  | state | DOWN    | mode  | DEFAULT | group | default | qlen          |              1000 | link/ether | 52:54:00:87:45:88 | brd | ff:ff:ff:ff:ff:ff |


** iw dev
#+BEGIN_SRC sh :results output
   iw dev
#+END_SRC

#+RESULTS:
#+begin_example
phy#0
	Unnamed/non-netdev interface
		wdev 0x2
		addr 48:45:20:ef:5b:e6
		type P2P-device
		txpower 0.00 dBm
	Interface wlo1
		ifindex 2
		wdev 0x1
		addr 48:45:20:ef:5b:e6
		ssid g2
		type managed
		channel 40 (5200 MHz), width: 20 MHz, center1: 5200 MHz
		txpower 22.00 dBm
		multicast TXQ:
			qsz-byt	qsz-pkt	flows	drops	marks	overlmt	hashcol	tx-bytes	tx-packets
			0	0	0	0	0	0	0	0		0
#+end_example

* Parsing Techniques

  
